import { StyleSheet, Text, View, FlatList, TextInput } from "react-native";
import { useEffect, useState } from "react";
import FoodListItem from "../../components/FoodSearch/FoodListItem";

const foodItems = [
  {
    label: "Борщ",
    cal: 150,
    brand: "Українська кухня",
    description:
      "Борщ - це традиційна українська страва, що відома своїм багатим смаком та ароматом. Цей суп виготовляється зі свіжих овочів, таких як буряк, картопля, морква, капуста, а також з додаванням м'яса або грибів. Борщ завжди вважається смачним та ситним обідом.",
  },
  {
    label: "Вареники з картоплею",
    cal: 200,
    brand: "Українська кухня",
    description:
      "Вареники з картоплею - це класична українська страва, яка відома своєю простотою та смаком. Ці підливки готуються із тіста, в яке завернута начинка з вареної картоплі. Вони часто подаються зі сметаною або вершковим маслом і стають улюбленим обідом для багатьох людей.",
  },
  {
    label: "Олів'є",
    cal: 180,
    brand: "Домашній рецепт",
    description:
      "Олів'є - це популярний салат, який часто подається на святкових столах. Він складається зі свіжих овочів, яйця, маринованого огірка, вареної курки або балика, підливки та майонезу. Цей салат має багатий смак та апетитний вигляд.",
  },
  {
    label: "Суп-харчо",
    cal: 220,
    brand: "Узбецька кухня",
    description:
      "Суп-харчо - це традиційна узбецька страва, яка відома своїм глибоким ароматом та насиченим смаком. Цей суп готується з м'яса (зазвичай ягняти або яловичини), рису, цибулі, моркви та спецій. Він часто подається зі свіжим хлібом та зеленим луком.",
  },
  {
    label: "Лазанья",
    cal: 320,
    brand: "Італійська кухня",
    description:
      "Лазанья - це італійська страва, що складається з шарів листів лазаньї, соусу болоньєзе, бешамельного соусу та сирного шару. Ця страва відома своєю ситністю та багатим смаком. Лазанья завжди вважається вишуканим обідом.",
  },
  {
    label: "Свіжий салат з руколою",
    cal: 90,
    brand: "Органічні продукти",
    description:
      "Свіжий салат з руколою - це легкий та освіжаючий варіант для обіду або вечері. Цей салат складається зі свіжої руколи, нарізаного помідора, шматочків сиру фета, оливок та заправки з оливкової олії та бальзамічного оцту.",
  },
  {
    label: "Місо суп",
    cal: 120,
    brand: "Японська кухня",
    description:
      "Місо суп - це традиційна японська страва, яка виготовляється на основі місо-пасті, додаванням води, твердих тофу, водоростей та інших інгредієнтів. Цей суп має насичений смак та відомий своєю корисністю для здоров'я.",
  },
  {
    label: "Сік з моркви та апельсинів",
    cal: 100,
    brand: "Соки",
    description:
      "Сік з моркви та апельсинів - це освіжаючий напій, який багатий на вітаміни та корисні речовини. Цей сік виготовляється зі свіжої моркви та соковистих апельсинів без додавання цукру або консервантів.",
  },
  {
    label: "Сирники",
    cal: 180,
    brand: "Домашній рецепт",
    description:
      "Сирники - це смачна та поживна страва, що виготовляється з творогу, яєць, муки та цукру. Ці смажені сирники часто подаються з вершковим маслом, сиропом або варенням та завжди вважаються улюбленою стравою для сніданку чи перекусу.",
  },
  {
    label: "Панакота",
    cal: 180,
    brand: "Італійська кухня",
    description:
      "Панакота - це класичний італійський десерт, який відомий своєю ніжною текстурою та неперевершеним смаком. Цей десерт виготовляється з вершків, цукру та желатину, який потім заливається фруктовим сиропом або карамеллю.",
  },
  {
    label: "Сирники",
    cal: 180,
    brand: "Домашній рецепт",
    description:
      "Сирники - це смачна та поживна страва, що виготовляється з творогу, яєць, муки та цукру. Ці смажені сирники часто подаються з вершковим маслом, сиропом або варенням та завжди вважаються улюбленою стравою для сніданку чи перекусу.",
  },
  {
    label: "Панакота",
    cal: 180,
    brand: "Італійська кухня",
    description:
      "Панакота - це класичний італійський десерт, який відомий своєю ніжною текстурою та неперевершеним смаком. Цей десерт виготовляється з вершків, цукру та желатину, який потім заливається фруктовим сиропом або карамеллю.",
  },
];

const FoodSearchScreen = () => {
  const [search, setSearch] = useState("");
  const [data, setData] = useState(foodItems);
  useEffect(() => {
    if (search) {
      const filteredData = foodItems.filter((item) =>
        item.label
          .toLowerCase()
          .split(" ")
          .some((word) => word.startsWith(search.toLowerCase()))
      );
      setData(filteredData);
    } else {
      setData(foodItems);
    }
  }, [search]);

  return (
    <View style={styles.container}>
      <View style={{ marginTop: 20 }}>
        <TextInput
          value={search}
          onChangeText={setSearch}
          placeholder="Пошук..."
          style={styles.input}
        ></TextInput>
        <Text>{search}</Text>
      </View>
      <View>
        <FlatList
          data={data}
          renderItem={({ item }) => <FoodListItem item={item} />}
          contentContainerStyle={{ gap: 5 }}
        />
      </View>
    </View>
  );
};

export default FoodSearchScreen;

const styles = StyleSheet.create({
  container: {
    flex: 1,
    backgroundColor: "#fff",
    padding: 10,
    gap: 10,
    paddingBottom: 100,
  },
  input: {
    backgroundColor: "#f2f2f2",
    padding: 10,
    borderRadius: 20,
    borderColor: "#4169E1",
  },
});
